nixidee/ESP32-Soiltest/Claude/src/main.cpp
        esp_adc_cal_value_t val_type = esp_adc_cal_characterize(ADC_UNIT_1,
                                                               ADC_ATTEN_DB_11,
                                                               ADC_WIDTH_BIT_12,
                                                               0,
                                                               &adc_chars);
        if (val_type == ESP_ADC_CAL_VAL_EFUSE_TP) {
            ESP_LOGI(TAG, "ADC two-point calibration loaded from eFuse");
        } else if (val_type == ESP_ADC_CAL_VAL_EFUSE_VREF) {
            ESP_LOGI(TAG, "ADC Vref calibration loaded from eFuse");
        } else {
            ESP_LOGW(TAG, "ADC calibration default Vref used");
        }
        adc_calibrated = true;
    }

    int adc_raw = analogRead(BATTERY_VOLTAGE_PIN);
    uint32_t voltage_mv = esp_adc_cal_raw_to_voltage(adc_raw, &adc_chars);
    float voltage = (voltage_mv / 1000.0f) * VBAT_DIVIDER_RATIO;
    return voltage;
}

/**
 * Berechnet Batteriestand in Prozent
 * @param voltage Batteriespannung in V
 * @return Batteriestand in %
 */
uint8_t calculateBatteryPercent(float voltage) {
    // LiPo Batterie: 4.2V = 100%, 3.0V = 0%
    const float max_voltage = 4.2;
    const float min_voltage = 3.0;
    
    if (voltage >= max_voltage) return 100;
    if (voltage <= min_voltage) return 0;
    
    return (uint8_t)((voltage - min_voltage) / (max_voltage - min_voltage) * 100);
}

/**
 * Liest alle Sensordaten
 */
void readSensorData() {
    ESP_LOGI(TAG, "Lese Sensordaten...");
    
    // Bodenfeuchte-Sensor einschalten
    digitalWrite(SOIL_SENSOR_POWER_PIN, HIGH);
    delay(100); // Stabilisierung
    
    // Bodenfeuchte lesen (mehrere Messungen für Stabilität)
    uint32_t soil_sum = 0;
    for(int i = 0; i < 5; i++) {
        soil_sum += analogRead(SOIL_SENSOR_PIN);
        delay(10);
    }
    uint16_t soil_moisture = soil_sum / 5;
    uint8_t soil_category = categorizeSoilMoisture(soil_moisture);
    
    // Bodenfeuchte-Sensor ausschalten (Stromsparend)
    digitalWrite(SOIL_SENSOR_POWER_PIN, LOW);
    
    // BME280 Daten lesen
    float temperature = NAN;
    float humidity = NAN;
    float pressure = NAN;
    float abs_humidity = NAN;
    float dew_point = NAN;

    if (bme.takeForcedMeasurement()) {
        temperature = bme.readTemperature();
        humidity = bme.readHumidity();
        pressure = bme.readPressure() / 100.0F; // Pa zu hPa
        abs_humidity = calculateAbsoluteHumidity(temperature, humidity);
        dew_point = calculateDewPoint(temperature, humidity);
    } else {
        ESP_LOGE(TAG, "BME280 Messung fehlgeschlagen!");
    }

    // Batterie lesen
    float battery_voltage = readBatteryVoltage();
    uint8_t battery_percent = calculateBatteryPercent(battery_voltage);

    // Ladespannung (falls verfügbar über USB)
    // Hinweis: FireBeetle 2 hat keinen direkten Zugriff auf VIN wenn über Batterie betrieben
    float charge_voltage = 0.0; // Implementierung board-spezifisch

    // Kritischen Bereich betreten
    xSemaphoreTake(dataMutex, portMAX_DELAY);

    current_data.soil_moisture = soil_moisture;
    current_data.soil_category = soil_category;
    current_data.temperature = temperature;
    current_data.humidity = humidity;
    current_data.pressure = pressure;
    current_data.abs_humidity = abs_humidity;
    current_data.dew_point = dew_point;
    current_data.battery_voltage = battery_voltage;
    current_data.battery_percent = battery_percent;
    current_data.charge_voltage = charge_voltage;

    // Zigbee Attribute aktualisieren
    attr_soil_moisture = soil_moisture;
    attr_temperature = (int16_t)(temperature * 100);
    attr_humidity = (uint16_t)(humidity * 100);
    attr_pressure = (int16_t)(pressure * 10);
    attr_dewpoint = (int16_t)(dew_point * 100);
    attr_battery_voltage = (uint8_t)(battery_voltage * 10);
    attr_battery_percentage = battery_percent * 2;

    if (zigbee_initialized) {
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT,
            ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID,
            &attr_temperature, sizeof(attr_temperature));
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT,
            ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID,
            &attr_humidity, sizeof(attr_humidity));
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT,
            0x0000,
            &attr_pressure, sizeof(attr_pressure));
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_ANALOG_INPUT,
            0xF001,
            &attr_soil_moisture, sizeof(attr_soil_moisture));
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_ANALOG_INPUT,
            ESP_ZB_ZCL_ATTR_ANALOG_INPUT_PRESENT_VALUE_ID,
            &attr_dewpoint, sizeof(attr_dewpoint));
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_POWER_CONFIG,
            ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID,
            &attr_battery_voltage, sizeof(attr_battery_voltage));
        esp_zb_zcl_set_attr_val(ENDPOINT_ID,
            ESP_ZB_ZCL_CLUSTER_ID_POWER_CONFIG,
            ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID,
            &attr_battery_percentage, sizeof(attr_battery_percentage));
    }

    xSemaphoreGive(dataMutex);
    
    // Debug Ausgabe
    ESP_LOGI(TAG, "=== Sensordaten ===");
    ESP_LOGI(TAG, "Temperatur: %.2f °C", current_data.temperature);
    ESP_LOGI(TAG, "Luftfeuchtigkeit: %.2f %%", current_data.humidity);
    ESP_LOGI(TAG, "Luftdruck: %.2f hPa", current_data.pressure);
    ESP_LOGI(TAG, "Abs. Luftfeuchtigkeit: %.2f g/m³", current_data.abs_humidity);
    ESP_LOGI(TAG, "Taupunkt: %.2f °C", current_data.dew_point);
    ESP_LOGI(TAG, "Bodenfeuchte: %d (ADC) - %s",
            current_data.soil_moisture,
            soilCategoryToString(current_data.soil_category));
    ESP_LOGI(TAG, "Batterie: %.2fV (%d%%)",
            current_data.battery_voltage,
            current_data.battery_percent);
}

// ==================== ZIGBEE FUNKTIONEN ====================

/**
 * Custom ZCL action handler
 *  - Handles manufacturer specific attributes in the Basic cluster
 */
static esp_err_t zcl_action_handler(esp_zb_core_action_t action, void *event, uint16_t manufacturer_code)
{
    ESP_UNUSED(manufacturer_code);

    switch (action) {
        case ESP_ZB_CORE_ACTION_WRITE_ATTR: {
            esp_zb_zcl_set_attr_value_t *set_attr = (esp_zb_zcl_set_attr_value_t *)event;
            if (set_attr->cluster_id != ESP_ZB_ZCL_CLUSTER_ID_BASIC) {
                break;
            }

            switch (set_attr->attribute_id) {
                case 0x0201: { // measure interval
                    uint16_t new_interval = *(uint16_t *)set_attr->value;
                    if (new_interval < MIN_MEASURE_INTERVAL) new_interval = MIN_MEASURE_INTERVAL;
                    if (new_interval > MAX_MEASURE_INTERVAL) new_interval = MAX_MEASURE_INTERVAL;
                    measure_interval = new_interval;
                    preferences.putUInt("interval", measure_interval);
                    break;
                }
                case 0x0202: { // wifi ssid
                    const char *ssid = (const char *)set_attr->value;
                    preferences.putString("wifi_ssid", String(ssid));
                    break;
                }
                case 0x0203: { // wifi password
                    const char *pass = (const char *)set_attr->value;
                    preferences.putString("wifi_pass", String(pass));
                    break;
                }
                case 0x0204: { // webserver enable
                    uint8_t enable = *(uint8_t *)set_attr->value;
                    enableWebServer = enable ? true : false;
                    preferences.putBool("webserver", enableWebServer);
                    break;
                }
                default:
                    break;
            }
            break;
        }
        case ESP_ZB_CORE_ACTION_READ_ATTR: {
            esp_zb_zcl_get_attr_value_t *get_attr = (esp_zb_zcl_get_attr_value_t *)event;
            if (get_attr->cluster_id != ESP_ZB_ZCL_CLUSTER_ID_BASIC) {
                break;
            }

            switch (get_attr->attribute_id) {
                case 0x0201: {
                    *(uint16_t *)get_attr->value = (uint16_t)measure_interval;
                    break;
                }
                case 0x0202: {
                    const String ssid = preferences.getString("wifi_ssid", DEFAULT_WIFI_SSID);
                    strncpy((char *)get_attr->value, ssid.c_str(), get_attr->size);
                    break;
                }
                case 0x0203: {
                    const String pass = preferences.getString("wifi_pass", DEFAULT_WIFI_PASSWORD);
                    strncpy((char *)get_attr->value, pass.c_str(), get_attr->size);
                    break;
                }
                case 0x0204: {
                    *(uint8_t *)get_attr->value = enableWebServer ? 1 : 0;
                    break;
                }
                default:
                    break;
            }
            break;
        }
        default:
            break;
    }
    return ESP_OK;
}

/**
 * Zigbee Stack Signal Handler
 */
static void esp_zb_app_signal_handler(esp_zb_app_signal_t *signal_struct) {
    uint32_t *p_sg_p = signal_struct->p_app_signal;
    esp_err_t err_status = signal_struct->esp_err_status;
    esp_zb_app_signal_type_t sig_type = *p_sg_p;

    // Register ZCL command handler
    esp_zb_core_action_handler_register(zcl_action_handler);

    switch (sig_type) {
        case ESP_ZB_ZDO_SIGNAL_SKIP_STARTUP:
            ESP_LOGI(TAG, "Zigbee stack initialized");
            esp_zb_bdb_start_top_level_commissioning(ESP_ZB_BDB_MODE_INITIALIZATION);
            break;
            
        case ESP_ZB_BDB_SIGNAL_DEVICE_FIRST_START:
        case ESP_ZB_BDB_SIGNAL_DEVICE_REBOOT:
            if (err_status == ESP_OK) {
                ESP_LOGI(TAG, "Start network steering");
                esp_zb_bdb_start_top_level_commissioning(ESP_ZB_BDB_MODE_NETWORK_STEERING);
            } else {
                ESP_LOGE(TAG, "Failed to initialize Zigbee stack (status: %d)", err_status);
            }
            break;
            
