nixidee/ESP32-Soiltest/Claude/src/main.cpp
        case ESP_ZB_BDB_SIGNAL_STEERING:
            if (err_status == ESP_OK) {
                ESP_LOGI(TAG, "Joined network successfully");
                zigbee_initialized = true;
                digitalWrite(LED_PIN, HIGH); // LED an wenn verbunden
            } else {
                ESP_LOGI(TAG, "Network steering was not successful (status: %d)", err_status);
                esp_zb_scheduler_alarm((esp_zb_callback_t)esp_zb_bdb_start_top_level_commissioning, 
                                     ESP_ZB_BDB_MODE_NETWORK_STEERING, 1000);
            }
            break;
            
        case ESP_ZB_COMMON_SIGNAL_CAN_SLEEP:
            ESP_LOGI(TAG, "Zigbee can sleep");
            // Hier könnten wir Light Sleep aktivieren
            // esp_zb_sleep_now();
            break;
            
        default:
            ESP_LOGI(TAG, "ZDO signal: %d, status: %d", sig_type, err_status);
            break;
    }
}

/**
 * Zigbee Attribute setzen
 */
static void esp_zb_set_attributes(void) {
    // Basic Cluster Attribute
    esp_zb_attribute_list_t *basic_cluster = esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_BASIC);
    esp_zb_basic_cluster_add_attr(basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_MANUFACTURER_NAME_ID, 
                                 (void *)MANUFACTURER_NAME);
    esp_zb_basic_cluster_add_attr(basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_MODEL_IDENTIFIER_ID, 
                                 (void *)MODEL_IDENTIFIER);
    uint8_t power_source = 0x03; // Battery
    esp_zb_basic_cluster_add_attr(basic_cluster, ESP_ZB_ZCL_ATTR_BASIC_POWER_SOURCE_ID, 
                                 &power_source);
    
    // Temperature Measurement Cluster
    esp_zb_attribute_list_t *temperature_cluster =
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT);
    esp_zb_temperature_meas_cluster_add_attr(temperature_cluster,
        ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID, &attr_temperature);
    int16_t temp_min = -4000; // -40°C
    esp_zb_temperature_meas_cluster_add_attr(temperature_cluster,
        ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MIN_VALUE_ID, &temp_min);
    int16_t temp_max = 12500; // 125°C  
    esp_zb_temperature_meas_cluster_add_attr(temperature_cluster,
        ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_MAX_VALUE_ID, &temp_max);
    
    // Humidity Measurement Cluster
    esp_zb_attribute_list_t *humidity_cluster =
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT);
    esp_zb_humidity_meas_cluster_add_attr(humidity_cluster,
        ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID, &attr_humidity);
    uint16_t humidity_min = 0;
    esp_zb_humidity_meas_cluster_add_attr(humidity_cluster,
        ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_MIN_VALUE_ID, &humidity_min);
    uint16_t humidity_max = 10000; // 100%
    esp_zb_humidity_meas_cluster_add_attr(humidity_cluster,
        ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_MAX_VALUE_ID, &humidity_max);
    
    // Pressure Measurement Cluster (Custom)
    esp_zb_attribute_list_t *pressure_cluster =
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT);
    esp_zb_custom_cluster_add_custom_attr(pressure_cluster, 0x0000,
        ESP_ZB_ZCL_ATTR_TYPE_S16, ESP_ZB_ZCL_ATTR_ACCESS_READ_ONLY | ESP_ZB_ZCL_ATTR_ACCESS_REPORTING,
        &attr_pressure);
    
    // Power Configuration Cluster (Battery)
    esp_zb_attribute_list_t *power_cfg_cluster =
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_POWER_CONFIG);
    esp_zb_power_config_cluster_add_attr(power_cfg_cluster,
        ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID, &attr_battery_voltage);
    esp_zb_power_config_cluster_add_attr(power_cfg_cluster,
        ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID, &attr_battery_percentage);
    
    // Analog Input Cluster für Taupunkt und Bodenfeuchte
    esp_zb_attribute_list_t *analog_cluster =
        esp_zb_zcl_attr_list_create(ESP_ZB_ZCL_CLUSTER_ID_ANALOG_INPUT);
    esp_zb_custom_cluster_add_custom_attr(analog_cluster,
        ESP_ZB_ZCL_ATTR_ANALOG_INPUT_PRESENT_VALUE_ID,
        ESP_ZB_ZCL_ATTR_TYPE_S16,
        ESP_ZB_ZCL_ATTR_ACCESS_READ_ONLY | ESP_ZB_ZCL_ATTR_ACCESS_REPORTING,
        &attr_dewpoint);
    esp_zb_custom_cluster_add_custom_attr(analog_cluster,
        0xF001,
        ESP_ZB_ZCL_ATTR_TYPE_U16,
        ESP_ZB_ZCL_ATTR_ACCESS_READ_ONLY | ESP_ZB_ZCL_ATTR_ACCESS_REPORTING,
        &attr_soil_moisture);
    
    // Cluster Liste erstellen
    esp_zb_cluster_list = esp_zb_zcl_cluster_list_create();
    esp_zb_cluster_list_add_basic_cluster(esp_zb_cluster_list, basic_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_temperature_meas_cluster(esp_zb_cluster_list, temperature_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_humidity_meas_cluster(esp_zb_cluster_list, humidity_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_pressure_meas_cluster(esp_zb_cluster_list, pressure_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_power_config_cluster(esp_zb_cluster_list, power_cfg_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
    esp_zb_cluster_list_add_analog_input_cluster(esp_zb_cluster_list, analog_cluster, ESP_ZB_ZCL_CLUSTER_SERVER_ROLE);
}

/**
 * Sendet Zigbee Report mit aktuellen Sensordaten
 */
void sendZigbeeReport() {
    if (!zigbee_initialized) {
        ESP_LOGW(TAG, "Zigbee nicht initialisiert, überspringe Report");
        return;
    }
    
    ESP_LOGI(TAG, "Sende Zigbee Report...");
    
    // Temperature Report
    esp_zb_zcl_report_attr_cmd_t temp_cmd = {
        .zcl_basic_cmd = {
            .dst_addr_u.addr_short = 0x0000, // Coordinator
            .dst_endpoint = 1,
            .src_endpoint = ENDPOINT_ID,
        },
        .address_mode = ESP_ZB_APS_ADDR_MODE_16_ENDP_PRESENT,
        .clusterID = ESP_ZB_ZCL_CLUSTER_ID_TEMP_MEASUREMENT,
        .attributeID = ESP_ZB_ZCL_ATTR_TEMP_MEASUREMENT_VALUE_ID,
        .cluster_role = ESP_ZB_ZCL_CLUSTER_SERVER_ROLE,
    };
    esp_zb_zcl_report_attr_cmd_req(&temp_cmd);
    
    // Humidity Report
    esp_zb_zcl_report_attr_cmd_t humidity_cmd = temp_cmd;
    humidity_cmd.clusterID = ESP_ZB_ZCL_CLUSTER_ID_REL_HUMIDITY_MEASUREMENT;
    humidity_cmd.attributeID = ESP_ZB_ZCL_ATTR_REL_HUMIDITY_MEASUREMENT_VALUE_ID;
    esp_zb_zcl_report_attr_cmd_req(&humidity_cmd);

    // Dew Point Report
    esp_zb_zcl_report_attr_cmd_t dewpoint_cmd = temp_cmd;
    dewpoint_cmd.clusterID = ESP_ZB_ZCL_CLUSTER_ID_ANALOG_INPUT;
    dewpoint_cmd.attributeID = ESP_ZB_ZCL_ATTR_ANALOG_INPUT_PRESENT_VALUE_ID;
    esp_zb_zcl_report_attr_cmd_req(&dewpoint_cmd);

    // Soil Moisture Report
    esp_zb_zcl_report_attr_cmd_t soil_cmd = temp_cmd;
    soil_cmd.clusterID = ESP_ZB_ZCL_CLUSTER_ID_ANALOG_INPUT;
    soil_cmd.attributeID = 0xF001;
    esp_zb_zcl_report_attr_cmd_req(&soil_cmd);

    // Pressure Report
    esp_zb_zcl_report_attr_cmd_t pressure_cmd = temp_cmd;
    pressure_cmd.clusterID = ESP_ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT;
    pressure_cmd.attributeID = 0x0000;
    esp_zb_zcl_report_attr_cmd_req(&pressure_cmd);

    // Battery Voltage Report
    esp_zb_zcl_report_attr_cmd_t batt_v_cmd = temp_cmd;
    batt_v_cmd.clusterID = ESP_ZB_ZCL_CLUSTER_ID_POWER_CONFIG;
    batt_v_cmd.attributeID = ESP_ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID;
    esp_zb_zcl_report_attr_cmd_req(&batt_v_cmd);

